<!-- dflook/terraform-github-actions {"workspace":"diff-trunc-compare-2","backend_type":"remote","backend":"4afe5671fafec85b51da6edc7b4337f15b4a742d5bb4a8a1364a2f0e11bdcb21","plan_job_ref":"Job Test Terraform cloud #356 at https://github.com/dflook/terraform-github-actions/actions/runs/16695493717","plan_hash":"4c2596ffa2c62a3f543533b1e1f0c13e5d26c9c33d3b72f60f51b65c172cd218","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/0.13__ in the __diff-trunc-compare-2__ workspace
With var files: `tests/workflows/test-cloud/0.13/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.the_id will be created
+   resource "random_id" "the_id" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 5
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test Terraform cloud #356](https://github.com/dflook/terraform-github-actions/actions/runs/16695493717)